pong-to-rich/k6/refresh-load-test/Redis03.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)

INFO[0005] setup 완료: 100개 refreshToken 수집                source=console


  █ THRESHOLDS 

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<200' p(95)=5.64ms


  █ TOTAL RESULTS 

    checks_total.......: 29128   817.033925/s
    checks_succeeded...: 100.00% 29128 out of 29128
    checks_failed......: 0.00%   0 out of 29128

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00%  0 out of 14564
    refresh_duration...............: avg=2.59ms   min=744.38µs med=2.15ms   max=27.23ms  p(90)=4.12ms   p(95)=5.38ms  

    HTTP
    http_req_duration..............: avg=2.95ms   min=744.38µs med=2.16ms   max=62.98ms  p(90)=4.19ms   p(95)=5.64ms  
      { expected_response:true }...: avg=2.95ms   min=744.38µs med=2.16ms   max=62.98ms  p(90)=4.19ms   p(95)=5.64ms  
    http_req_failed................: 0.00%  0 out of 14664
    http_reqs......................: 14664  411.32194/s

    EXECUTION
    iteration_duration.............: avg=103.16ms min=100.87ms med=102.73ms max=144.41ms p(90)=104.76ms p(95)=106.02ms
    iterations.....................: 14564  408.516963/s
    vus............................: 50     min=0          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 11 MB  316 kB/s
    data_sent......................: 5.2 MB 147 kB/s



running (0m35.7s), 00/50 VUs, 14564 complete and 0 interrupted iterations
default ✓ [======================================] 50 VUs  30s